In [13]:
import pandas as pd # type: ignore

df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns=["A","B", "C"], index=["first", "second", "third", "Forth"])

new_df = df
new_df.index = [1,2,3,4]
df

    A   B   C
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [11]:
data = {
    "Student": ['David','Samuel','Terry','Even',],
    "Age": [27,24,22,32,],
    "Country": ['UK','Canada','China','USA',],
    "Course": ['Python','Data Structures','Machine Learning','Web Development',],
    "Marks": [85,72,89,75,],
}

df = pd.DataFrame(data)
df

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Even   32     USA   Web Development     75

In [9]:
b = df[["Marks"]]
b

   Marks
0     85
1     72
2     89
3     75

In [10]:
c = df[["Country", "Course"]]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development